# 1. Реализовать функцию, принимающую два числа (позиционные аргументы) и выполняющую их деление.
# Числа запрашивать у пользователя, предусмотреть обработку ситуации деления на ноль.

def deleniye(chislitel, znamenatel):
    return chislitel / znamenatel

x1 = int(input("Введите числитель:  "))
x2 = int(input("Введите знаменатель:  "))
while x2 == 0:
    print("Деление на 0 запрещено!")
    x2 = int(input("Введите допустимый знаменатель:  "))

# ---------------------------------

x3 = deleniye(x1, x2)

print("Результат деления =   ", x3)

