# 2. Реализовать функцию, принимающую несколько параметров, описывающих данные пользователя:
# имя, фамилия, год рождения, город проживания, email, телефон.
# Функция должна принимать параметры как именованные аргументы.
# Реализовать вывод данных о пользователе одной строкой.

def vyvod_dan(Name, Last_name, Year, City, Email, Phone):
    print(p1, "  ", p2, "  ", p3, "  ", p4, "  ", p5, "  ", p6)

# ---------------------------------

p1 = "Dima"
p2 = "P."
p3 = "2000"
p4 = "Los Santos"
p5 = "Dima@p.san"
p6 = "2233222332"

vyvod_dan(Name = p1, Last_name = p2, Year = p3, City = p4, Email = p5, Phone = p6)
