# 4. Программа принимает действительное положительное число x и целое отрицательное число y.
# Необходимо выполнить возведение числа x в степень y.
# Задание необходимо реализовать в виде функции my_func(x, y).
# При решении задания необходимо обойтись без встроенной функции возведения числа в степень.
# Подсказка: попробуйте решить задачу двумя способами. Первый — возведение в степень с помощью оператора **.
# Второй — более сложная реализация без оператора **, предусматривающая использование цикла.

def my_func1(x, y):
    r = x ** y
    return r

def my_func2(x, y):
    y = - y
    r = 1
    for i in range(y):
        r = r / x
        #print(r)
    return r

# ---------------------------------
x = float(input("Введите действительное положительное число x:  "))
y = int(input("Введите целое отрицательное число y:  "))
while y >= 0:
    y = int(input("Введите целое отрицательное число y:  "))

print("1 вариант возведение в степень с помощью оператора ** :  ")
print("Результат =  ", my_func1(x, y))


print("2 реализация без оператора **, предусматривающая использование цикла:  ")
print("Результат =  ", my_func2(x, y))
