# 5. Программа запрашивает у пользователя строку чисел, разделенных пробелом.
# При нажатии Enter должна выводиться сумма чисел.
# Пользователь может продолжить ввод чисел, разделенных пробелом и снова нажать Enter.
# Сумма вновь введенных чисел будет добавляться к уже подсчитанной сумме.
# Но если вместо числа вводится специальный символ, выполнение программы завершается.
# Если специальный символ введен после нескольких чисел, то вначале нужно добавить сумму этих чисел
# к полученной ранее сумме и после этого завершить программу.

def sum(s):
    r = 0
    list = s.split(" ")
    for l in  list:
        r = r + int(l)
    return r

# ---------------------------------

str = str(input('Введите строку чисел, разделенных пробелами '))
str = str.strip()
s = str.replace(' ', '')
while s.isdigit() is False:
    str = str(input('Введите строку чисел, разделенных пробелами '))
    str = str.strip()
    s = str.replace(' ', '')

print("Сумма чисел =  ", sum(str))

while True:

    delta = input('Введите ещё строку чисел и/или q - для выхода ')
    delta = delta.strip()

    D = delta.upper()
    if D.find("Q") >= 0:
        delta = delta[0:D.find("Q")]
        str = str + " " + delta
        str = str.strip()
        break

    s = delta.replace(' ', '')
    if s.isdigit() is False:
        print("Только строку чисел и/или q - для выхода ")
        continue

    str = str + " " + delta

print("Получилась итоговая строка", str)
print("Сумма чисел строки =  ", sum(str))


