# 6. Реализовать функцию int_func(), принимающую слово из маленьких латинских букв
# и возвращающую его же, но с прописной первой буквой. Например, print(int_func(‘text’)) -> Text.
# Продолжить работу над заданием. В программу должна попадать строка из слов, разделенных пробелом.
# Каждое слово состоит из латинских букв в нижнем регистре.
# Сделать вывод исходной строки, но каждое слово должно начинаться с заглавной буквы.
# Необходимо использовать написанную ранее функцию int_func().

def int_func(s):
    return s[0].upper() + s[1:len(s)]

def vvod():
    str = input(
        "Введите строку из слов, разделенных пробелом. Каждое слово состоит из латинских букв в нижнем регистре:  ")
    str = str.strip()
    return str.lower()  # Строка преобразована к нижнему регистру

def perebor(str):
    list = str.split(" ")
    r = ""
    for l in list:
        r = r + " " + int_func(l)

    return r

# ---------------------------------

str = vvod()
r = perebor(str)
print("Строка каждое слово которой начинатеся с заглавной буквы  ", r)


